# RbsElecLoadsummaryDemandFactorParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecLoadsummaryDemandFactorParam Property
ParameterTypeId Class See Also
---
"Demand Factor"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecLoadsummaryDemandFactorParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecLoadsummaryDemandFactorParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecLoadsummaryDemandFactorParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace